In [ ]:
# check access to new schema

In [12]:
import pandas as pd
import numpy as np
import psycopg2 as psycopg2
import sql_functions as sqlf

In [2]:
rows = 100
cols = 3

random = np.random.randint(low=0, high=20, size=(rows, cols))

random = pd.DataFrame(random)

random

     0   1   2
0    9  18   6
1    2  14  16
2   12  17  12
3    3   8   6
4   17   5  14
..  ..  ..  ..
95   9  15  17
96  10  13  15
97   4  13   8
98   9   1   7
99  14  12   2

[100 rows x 3 columns]

In [4]:
engine = sqlf.get_engine()
engine

Engine(postgresql://user:***@host/database)

In [5]:
schema = "capstone_24_4_group1"
schema

'capstone_24_4_group1'

In [6]:
table_name = 'testing_table'
# If the specified table doesn't exist yet, it will be created
# With 'replace', your data will be replaced if the table already exists.
# This may take some time ...

# Write records stored in a dataframe to SQL database
if engine!=None:
    try:
        random.to_sql(name=table_name, # Name of SQL table
                        con=engine, # Engine or connection
                        if_exists='replace', # Drop the table before inserting new values 
                        schema=schema, # Use schmea that was defined earlier
                        index=False, # Write DataFrame index as a column
                        chunksize=5000, # Specify the number of rows in each batch to be written at a time
                        method='multi') # Pass multiple values in a single INSERT clause
        print(f"The {table_name} table was imported successfully.")
    # Error handling
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        engine = None

The testing_table table was imported successfully.

In [7]:
# Just to be sure: Check if the number of rows match
random_query = f'''SELECT *
                    FROM {schema}.{table_name}
                    '''

In [8]:
sqlf.get_dataframe(random_query)

     0   1   2
0    9  18   6
1    2  14  16
2   12  17  12
3    3   8   6
4   17   5  14
..  ..  ..  ..
95   9  15  17
96  10  13  15
97   4  13   8
98   9   1   7
99  14  12   2

[100 rows x 3 columns]

In [11]:
movie_query = f'''SELECT count(*)
                    FROM {schema}."movie_data_EU"
                    '''

sqlf.get_dataframe(movie_query)

   count
0   4956

### Get current Data joined

In [15]:
schema = "capstone_24_4_group1"


testing_query = f'''SELECT count(*)
                    FROM {schema}."IMDB_data"
                    '''


sqlf.get_dataframe(testing_query)

    count
0  185358

In [2]:
import pandas as pd

In [3]:
test = pd.read_csv("Data/title.principals/title.basics.csv")

In [4]:
test.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0.0,1894.0,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0.0,1892.0,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0.0,1892.0,\N,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0.0,1892.0,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0.0,1893.0,\N,1,"Comedy,Short"

In [5]:
test.shape

(11057208, 9)